Upgrade module from deploying version:
```
Terraform will perform the following actions:

  # module.clumio_byok.data.aws_iam_policy_document.role_policy_document will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "role_policy_document" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "kms:CreateGrant",
              + "kms:DescribeKey",
              + "kms:ListGrants",
              + "kms:ListRetirableGrants",
              + "kms:PutKeyPolicy",
              + "kms:ReplicateKey",
              + "kms:RetireGrant",
              + "kms:RevokeGrant",
              + "kms:TagResource",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:kms:*:082615160027:key/mrk-1eea0b05efc042b69201c52cc44a7da3",
            ]
        }
      + statement {
          + actions   = [
              + "kms:CreateKey",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
    }

  # module.clumio_byok.aws_iam_role.byok_mgmt_role will be updated in-place
  ~ resource "aws_iam_role" "byok_mgmt_role" {
        id                    = "ClumioKMSRole"
        name                  = "ClumioKMSRole"
        tags                  = {}
        # (12 unchanged attributes hidden)

      - inline_policy {
          - name   = "ReplicaAndGrantManagement" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "kms:TagResource",
                              - "kms:RevokeGrant",
                              - "kms:RetireGrant",
                              - "kms:ReplicateKey",
                              - "kms:PutKeyPolicy",
                              - "kms:ListRetirableGrants",
                              - "kms:ListGrants",
                              - "kms:DescribeKey",
                              - "kms:CreateGrant",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:kms:*:082615160027:key/mrk-1eea0b05efc042b69201c52cc44a7da3"
                        },
                      - {
                          - Action   = "kms:CreateKey"
                          - Effect   = "Allow"
                          - Resource = "*"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      + inline_policy {
          + name   = "ReplicaAndGrantManagement"
          + policy = (known after apply)
        }
    }

  # module.clumio_byok.aws_kms_alias.key_alias will be created
  + resource "aws_kms_alias" "key_alias" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/dongjoo"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = "mrk-1eea0b05efc042b69201c52cc44a7da3"
    }

  # module.clumio_byok.aws_kms_key.multi_region_cmk_key[0] will be updated in-place
  ~ resource "aws_kms_key" "multi_region_cmk_key" {
        id                                 = "mrk-1eea0b05efc042b69201c52cc44a7da3"
      ~ tags                               = {
          + "key" = "value"
        }
      ~ tags_all                           = {
          + "key" = "value"
        }
        # (14 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

Apply complete! Resources: 1 added, 1 changed, 0 destroyed.
```
Before upgrade:
![image](https://github.com/user-attachments/assets/ab221bd7-c3d6-4c5f-9fc1-b1c774ae6cb4)
After upgrade and apply alias name:
![image](https://github.com/user-attachments/assets/d4d688f0-e5c1-41e7-9dbd-441bdc3d5a4b)
